; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite4 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	image0 - mode
	thermograph4 - mode
	thermograph1 - mode
	infrared3 - mode
	thermograph2 - mode
	Star9 - direction
	Star19 - direction
	GroundStation44 - direction
	Star28 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation34 - direction
	Star2 - direction
	GroundStation24 - direction
	Star15 - direction
	GroundStation32 - direction
	Star35 - direction
	GroundStation18 - direction
	Star5 - direction
	Star8 - direction
	Star37 - direction
	Star40 - direction
	Star14 - direction
	Star33 - direction
	GroundStation39 - direction
	GroundStation48 - direction
	Star10 - direction
	Star41 - direction
	Star43 - direction
	GroundStation16 - direction
	GroundStation6 - direction
	Star26 - direction
	Star23 - direction
	GroundStation11 - direction
	Star30 - direction
	Star31 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star38 - direction
	Star13 - direction
	GroundStation49 - direction
	GroundStation17 - direction
	GroundStation7 - direction
	GroundStation45 - direction
	Star36 - direction
	Star46 - direction
	Star20 - direction
	Star12 - direction
	GroundStation25 - direction
	GroundStation29 - direction
	Star27 - direction
	Star42 - direction
	Star22 - direction
	GroundStation47 - direction
	Star21 - direction
	Planet50 - direction
	Star51 - direction
	Star52 - direction
	Phenomenon53 - direction
	Phenomenon54 - direction
	Planet55 - direction
	Star56 - direction
	Star57 - direction
	Planet58 - direction
	Phenomenon59 - direction
	Planet60 - direction
	Phenomenon61 - direction
	Phenomenon62 - direction
	Phenomenon63 - direction
	Phenomenon64 - direction
	Phenomenon65 - direction
	Planet66 - direction
	Planet67 - direction
	Star68 - direction
	Phenomenon69 - direction
	Planet70 - direction
	Star71 - direction
	Planet72 - direction
	Phenomenon73 - direction
	Planet74 - direction
	Star75 - direction
	Planet76 - direction
	Planet77 - direction
	Planet78 - direction
	Planet79 - direction
	Planet80 - direction
	Planet81 - direction
	Planet82 - direction
	Phenomenon83 - direction
	Phenomenon84 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star26)
	(calibration_target instrument0 Star20)
	(calibration_target instrument0 Star30)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 GroundStation49)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star14)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 Star20)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 Star40)
	(calibration_target instrument1 GroundStation32)
	(calibration_target instrument1 GroundStation29)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star28)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation24)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star35)
	(calibration_target instrument2 GroundStation34)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star41)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star21)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 Star20)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation25)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 Star31)
	(calibration_target instrument3 GroundStation32)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star33)
	(calibration_target instrument3 Star21)
	(calibration_target instrument3 Star22)
	(calibration_target instrument3 Star36)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation18)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star37)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation24)
	(calibration_target instrument3 GroundStation29)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star23)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation49)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation17)
	(calibration_target instrument5 Star26)
	(calibration_target instrument5 Star15)
	(calibration_target instrument5 Star40)
	(calibration_target instrument5 Star22)
	(calibration_target instrument5 Star43)
	(calibration_target instrument5 Star46)
	(calibration_target instrument5 Star38)
	(calibration_target instrument5 GroundStation24)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared3)
	(supports instrument6 image0)
	(calibration_target instrument6 Star15)
	(calibration_target instrument6 GroundStation39)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument7 thermograph4)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 GroundStation45)
	(calibration_target instrument7 GroundStation16)
	(calibration_target instrument7 Star35)
	(calibration_target instrument7 GroundStation25)
	(calibration_target instrument7 Star22)
	(calibration_target instrument7 GroundStation49)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star36)
	(calibration_target instrument7 Star37)
	(calibration_target instrument7 GroundStation32)
	(calibration_target instrument7 GroundStation29)
	(calibration_target instrument7 Star10)
	(calibration_target instrument7 GroundStation48)
	(calibration_target instrument7 Star43)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star8)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 GroundStation18)
	(calibration_target instrument8 GroundStation11)
	(calibration_target instrument8 Star38)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star51)
	(supports instrument9 thermograph2)
	(supports instrument9 infrared3)
	(calibration_target instrument9 Star13)
	(calibration_target instrument9 Star14)
	(calibration_target instrument9 Star22)
	(calibration_target instrument9 Star40)
	(calibration_target instrument9 Star37)
	(calibration_target instrument9 Star43)
	(supports instrument10 infrared3)
	(calibration_target instrument10 Star43)
	(calibration_target instrument10 Star26)
	(calibration_target instrument10 Star46)
	(calibration_target instrument10 Star20)
	(calibration_target instrument10 GroundStation11)
	(calibration_target instrument10 GroundStation47)
	(calibration_target instrument10 GroundStation45)
	(supports instrument11 image0)
	(supports instrument11 thermograph1)
	(supports instrument11 thermograph4)
	(calibration_target instrument11 GroundStation16)
	(supports instrument12 infrared3)
	(supports instrument12 image0)
	(calibration_target instrument12 Star42)
	(calibration_target instrument12 Star31)
	(calibration_target instrument12 Star36)
	(calibration_target instrument12 GroundStation6)
	(calibration_target instrument12 GroundStation16)
	(calibration_target instrument12 Star43)
	(calibration_target instrument12 Star41)
	(calibration_target instrument12 Star10)
	(calibration_target instrument12 GroundStation48)
	(calibration_target instrument12 GroundStation39)
	(calibration_target instrument12 Star33)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon69)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 Star38)
	(calibration_target instrument13 GroundStation45)
	(calibration_target instrument13 GroundStation1)
	(calibration_target instrument13 GroundStation4)
	(calibration_target instrument13 Star13)
	(calibration_target instrument13 Star21)
	(calibration_target instrument13 Star31)
	(calibration_target instrument13 Star30)
	(calibration_target instrument13 GroundStation11)
	(calibration_target instrument13 Star23)
	(calibration_target instrument13 Star26)
	(supports instrument14 infrared3)
	(supports instrument14 image0)
	(supports instrument14 thermograph4)
	(calibration_target instrument14 GroundStation7)
	(calibration_target instrument14 GroundStation17)
	(calibration_target instrument14 GroundStation49)
	(calibration_target instrument14 Star13)
	(supports instrument15 thermograph1)
	(supports instrument15 thermograph2)
	(calibration_target instrument15 Star21)
	(calibration_target instrument15 GroundStation47)
	(calibration_target instrument15 Star22)
	(calibration_target instrument15 Star42)
	(calibration_target instrument15 Star27)
	(calibration_target instrument15 GroundStation29)
	(calibration_target instrument15 GroundStation25)
	(calibration_target instrument15 Star12)
	(calibration_target instrument15 Star20)
	(calibration_target instrument15 Star46)
	(calibration_target instrument15 Star36)
	(calibration_target instrument15 GroundStation45)
	(on_board instrument13 satellite4)
	(on_board instrument14 satellite4)
	(on_board instrument15 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon63)
)
(:goal (and
	(pointing satellite0 GroundStation32)
	(pointing satellite2 Star5)
	(pointing satellite4 Phenomenon62)
	(have_image Planet50 thermograph4)
	(have_image Star51 thermograph2)
	(have_image Star52 thermograph2)
	(have_image Phenomenon53 thermograph2)
	(have_image Phenomenon54 thermograph1)
	(have_image Planet55 image0)
	(have_image Star56 image0)
	(have_image Star57 thermograph2)
	(have_image Planet58 thermograph2)
	(have_image Phenomenon59 thermograph4)
	(have_image Planet60 thermograph2)
	(have_image Phenomenon61 thermograph1)
	(have_image Phenomenon62 thermograph4)
	(have_image Phenomenon63 thermograph1)
	(have_image Phenomenon64 infrared3)
	(have_image Phenomenon65 image0)
	(have_image Planet66 image0)
	(have_image Planet67 thermograph1)
	(have_image Star68 infrared3)
	(have_image Phenomenon69 image0)
	(have_image Planet70 infrared3)
	(have_image Star71 image0)
	(have_image Planet72 thermograph2)
	(have_image Phenomenon73 image0)
	(have_image Planet74 thermograph1)
	(have_image Star75 thermograph2)
	(have_image Planet76 image0)
	(have_image Planet77 thermograph4)
	(have_image Planet78 thermograph4)
	(have_image Planet79 thermograph1)
	(have_image Planet80 thermograph4)
	(have_image Planet81 thermograph2)
	(have_image Planet82 thermograph4)
	(have_image Phenomenon83 image0)
	(have_image Phenomenon84 infrared3)
))

)

; plan
1. (switch_on instrument13 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument13)
   goals met: 0 of 38
2. (switch_on instrument11 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument11)
   goals met: 0 of 38
3. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 0 of 38
4. (turn_to satellite4 phenomenon62 phenomenon63)
   deleted: (pointing satellite4 phenomenon63)
   added: (pointing satellite4 phenomenon62)
   goals met: 1 of 38
5. (turn_to satellite2 star5 star51)
   deleted: (pointing satellite2 star51)
   added: (pointing satellite2 star5)
   goals met: 2 of 38
6. (turn_to satellite1 phenomenon53 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon53)
   goals met: 2 of 38
7. (turn_to satellite0 groundstation32 groundstation25)
   deleted: (pointing satellite0 groundstation25)
   added: (pointing satellite0 groundstation32)
   goals met: 3 of 38
8. (turn_to satellite3 groundstation16 phenomenon69)
   deleted: (pointing satellite3 phenomenon69)
   added: (pointing satellite3 groundstation16)
   goals met: 3 of 38
9. (calibrate satellite3 instrument11 groundstation16)
   added: (calibrated instrument11)
   goals met: 3 of 38
10. (turn_to satellite3 phenomenon54 groundstation16)
   deleted: (pointing satellite3 groundstation16)
   added: (pointing satellite3 phenomenon54)
   goals met: 3 of 38
11. (take_image satellite3 phenomenon54 instrument11 thermograph1)
   added: (have_image phenomenon54 thermograph1)
   goals met: 4 of 38
12. (turn_to satellite3 phenomenon59 phenomenon54)
   deleted: (pointing satellite3 phenomenon54)
   added: (pointing satellite3 phenomenon59)
   goals met: 4 of 38
13. (take_image satellite3 phenomenon59 instrument11 thermograph4)
   added: (have_image phenomenon59 thermograph4)
   goals met: 5 of 38
14. (turn_to satellite3 phenomenon61 phenomenon59)
   deleted: (pointing satellite3 phenomenon59)
   added: (pointing satellite3 phenomenon61)
   goals met: 5 of 38
15. (take_image satellite3 phenomenon61 instrument11 thermograph1)
   added: (have_image phenomenon61 thermograph1)
   goals met: 6 of 38
16. (turn_to satellite3 phenomenon62 phenomenon61)
   deleted: (pointing satellite3 phenomenon61)
   added: (pointing satellite3 phenomenon62)
   goals met: 6 of 38
17. (take_image satellite3 phenomenon62 instrument11 thermograph4)
   added: (have_image phenomenon62 thermograph4)
   goals met: 7 of 38
18. (turn_to satellite3 phenomenon63 phenomenon62)
   deleted: (pointing satellite3 phenomenon62)
   added: (pointing satellite3 phenomenon63)
   goals met: 7 of 38
19. (take_image satellite3 phenomenon63 instrument11 thermograph1)
   added: (have_image phenomenon63 thermograph1)
   goals met: 8 of 38
20. (turn_to satellite3 phenomenon65 phenomenon63)
   deleted: (pointing satellite3 phenomenon63)
   added: (pointing satellite3 phenomenon65)
   goals met: 8 of 38
21. (take_image satellite3 phenomenon65 instrument11 image0)
   added: (have_image phenomenon65 image0)
   goals met: 9 of 38
22. (turn_to satellite3 phenomenon69 phenomenon65)
   deleted: (pointing satellite3 phenomenon65)
   added: (pointing satellite3 phenomenon69)
   goals met: 9 of 38
23. (take_image satellite3 phenomenon69 instrument11 image0)
   added: (have_image phenomenon69 image0)
   goals met: 10 of 38
24. (turn_to satellite3 phenomenon73 phenomenon69)
   deleted: (pointing satellite3 phenomenon69)
   added: (pointing satellite3 phenomenon73)
   goals met: 10 of 38
25. (take_image satellite3 phenomenon73 instrument11 image0)
   added: (have_image phenomenon73 image0)
   goals met: 11 of 38
26. (turn_to satellite3 phenomenon83 phenomenon73)
   deleted: (pointing satellite3 phenomenon73)
   added: (pointing satellite3 phenomenon83)
   goals met: 11 of 38
27. (take_image satellite3 phenomenon83 instrument11 image0)
   added: (have_image phenomenon83 image0)
   goals met: 12 of 38
28. (turn_to satellite3 planet50 phenomenon83)
   deleted: (pointing satellite3 phenomenon83)
   added: (pointing satellite3 planet50)
   goals met: 12 of 38
29. (take_image satellite3 planet50 instrument11 thermograph4)
   added: (have_image planet50 thermograph4)
   goals met: 13 of 38
30. (turn_to satellite3 planet55 planet50)
   deleted: (pointing satellite3 planet50)
   added: (pointing satellite3 planet55)
   goals met: 13 of 38
31. (take_image satellite3 planet55 instrument11 image0)
   added: (have_image planet55 image0)
   goals met: 14 of 38
32. (turn_to satellite3 planet66 planet55)
   deleted: (pointing satellite3 planet55)
   added: (pointing satellite3 planet66)
   goals met: 14 of 38
33. (take_image satellite3 planet66 instrument11 image0)
   added: (have_image planet66 image0)
   goals met: 15 of 38
34. (turn_to satellite3 planet67 planet66)
   deleted: (pointing satellite3 planet66)
   added: (pointing satellite3 planet67)
   goals met: 15 of 38
35. (take_image satellite3 planet67 instrument11 thermograph1)
   added: (have_image planet67 thermograph1)
   goals met: 16 of 38
36. (turn_to satellite3 planet74 planet67)
   deleted: (pointing satellite3 planet67)
   added: (pointing satellite3 planet74)
   goals met: 16 of 38
37. (take_image satellite3 planet74 instrument11 thermograph1)
   added: (have_image planet74 thermograph1)
   goals met: 17 of 38
38. (turn_to satellite3 planet76 planet74)
   deleted: (pointing satellite3 planet74)
   added: (pointing satellite3 planet76)
   goals met: 17 of 38
39. (take_image satellite3 planet76 instrument11 image0)
   added: (have_image planet76 image0)
   goals met: 18 of 38
40. (turn_to satellite3 planet77 planet76)
   deleted: (pointing satellite3 planet76)
   added: (pointing satellite3 planet77)
   goals met: 18 of 38
41. (take_image satellite3 planet77 instrument11 thermograph4)
   added: (have_image planet77 thermograph4)
   goals met: 19 of 38
42. (turn_to satellite3 planet78 planet77)
   deleted: (pointing satellite3 planet77)
   added: (pointing satellite3 planet78)
   goals met: 19 of 38
43. (take_image satellite3 planet78 instrument11 thermograph4)
   added: (have_image planet78 thermograph4)
   goals met: 20 of 38
44. (turn_to satellite3 planet79 planet78)
   deleted: (pointing satellite3 planet78)
   added: (pointing satellite3 planet79)
   goals met: 20 of 38
45. (take_image satellite3 planet79 instrument11 thermograph1)
   added: (have_image planet79 thermograph1)
   goals met: 21 of 38
46. (turn_to satellite3 planet80 planet79)
   deleted: (pointing satellite3 planet79)
   added: (pointing satellite3 planet80)
   goals met: 21 of 38
47. (take_image satellite3 planet80 instrument11 thermograph4)
   added: (have_image planet80 thermograph4)
   goals met: 22 of 38
48. (turn_to satellite3 planet82 planet80)
   deleted: (pointing satellite3 planet80)
   added: (pointing satellite3 planet82)
   goals met: 22 of 38
49. (take_image satellite3 planet82 instrument11 thermograph4)
   added: (have_image planet82 thermograph4)
   goals met: 23 of 38
50. (turn_to satellite3 star56 planet82)
   deleted: (pointing satellite3 planet82)
   added: (pointing satellite3 star56)
   goals met: 23 of 38
51. (take_image satellite3 star56 instrument11 image0)
   added: (have_image star56 image0)
   goals met: 24 of 38
52. (turn_to satellite3 star71 star56)
   deleted: (pointing satellite3 star56)
   added: (pointing satellite3 star71)
   goals met: 24 of 38
53. (take_image satellite3 star71 instrument11 image0)
   added: (have_image star71 image0)
   goals met: 25 of 38
54. (turn_to satellite1 star15 phenomenon53)
   deleted: (pointing satellite1 phenomenon53)
   added: (pointing satellite1 star15)
   goals met: 25 of 38
55. (calibrate satellite1 instrument6 star15)
   added: (calibrated instrument6)
   goals met: 25 of 38
56. (turn_to satellite1 phenomenon53 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 phenomenon53)
   goals met: 25 of 38
57. (take_image satellite1 phenomenon53 instrument6 thermograph2)
   added: (have_image phenomenon53 thermograph2)
   goals met: 26 of 38
58. (turn_to satellite1 phenomenon64 phenomenon53)
   deleted: (pointing satellite1 phenomenon53)
   added: (pointing satellite1 phenomenon64)
   goals met: 26 of 38
59. (take_image satellite1 phenomenon64 instrument6 infrared3)
   added: (have_image phenomenon64 infrared3)
   goals met: 27 of 38
60. (turn_to satellite1 phenomenon84 phenomenon64)
   deleted: (pointing satellite1 phenomenon64)
   added: (pointing satellite1 phenomenon84)
   goals met: 27 of 38
61. (take_image satellite1 phenomenon84 instrument6 infrared3)
   added: (have_image phenomenon84 infrared3)
   goals met: 28 of 38
62. (turn_to satellite1 planet58 phenomenon84)
   deleted: (pointing satellite1 phenomenon84)
   added: (pointing satellite1 planet58)
   goals met: 28 of 38
63. (take_image satellite1 planet58 instrument6 thermograph2)
   added: (have_image planet58 thermograph2)
   goals met: 29 of 38
64. (turn_to satellite1 planet60 planet58)
   deleted: (pointing satellite1 planet58)
   added: (pointing satellite1 planet60)
   goals met: 29 of 38
65. (take_image satellite1 planet60 instrument6 thermograph2)
   added: (have_image planet60 thermograph2)
   goals met: 30 of 38
66. (turn_to satellite1 planet70 planet60)
   deleted: (pointing satellite1 planet60)
   added: (pointing satellite1 planet70)
   goals met: 30 of 38
67. (take_image satellite1 planet70 instrument6 infrared3)
   added: (have_image planet70 infrared3)
   goals met: 31 of 38
68. (turn_to satellite1 planet72 planet70)
   deleted: (pointing satellite1 planet70)
   added: (pointing satellite1 planet72)
   goals met: 31 of 38
69. (take_image satellite1 planet72 instrument6 thermograph2)
   added: (have_image planet72 thermograph2)
   goals met: 32 of 38
70. (turn_to satellite1 planet81 planet72)
   deleted: (pointing satellite1 planet72)
   added: (pointing satellite1 planet81)
   goals met: 32 of 38
71. (take_image satellite1 planet81 instrument6 thermograph2)
   added: (have_image planet81 thermograph2)
   goals met: 33 of 38
72. (turn_to satellite1 star51 planet81)
   deleted: (pointing satellite1 planet81)
   added: (pointing satellite1 star51)
   goals met: 33 of 38
73. (take_image satellite1 star51 instrument6 thermograph2)
   added: (have_image star51 thermograph2)
   goals met: 34 of 38
74. (turn_to satellite1 star52 star51)
   deleted: (pointing satellite1 star51)
   added: (pointing satellite1 star52)
   goals met: 34 of 38
75. (take_image satellite1 star52 instrument6 thermograph2)
   added: (have_image star52 thermograph2)
   goals met: 35 of 38
76. (turn_to satellite1 star57 star52)
   deleted: (pointing satellite1 star52)
   added: (pointing satellite1 star57)
   goals met: 35 of 38
77. (take_image satellite1 star57 instrument6 thermograph2)
   added: (have_image star57 thermograph2)
   goals met: 36 of 38
78. (turn_to satellite1 star68 star57)
   deleted: (pointing satellite1 star57)
   added: (pointing satellite1 star68)
   goals met: 36 of 38
79. (take_image satellite1 star68 instrument6 infrared3)
   added: (have_image star68 infrared3)
   goals met: 37 of 38
80. (turn_to satellite1 star75 star68)
   deleted: (pointing satellite1 star68)
   added: (pointing satellite1 star75)
   goals met: 37 of 38
81. (take_image satellite1 star75 instrument6 thermograph2)
   added: (have_image star75 thermograph2)
   goals met: 38 of 38
